
&НаКлиенте
Процедура СформироватьОтчет(Команда)

	ТабДок = СформироватьНаСервере();
  
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");	
	Возврат ОбъектОбработки.СоздатьОтчет();	
КонецФункции

&НаКлиенте
Процедура ОтправитьПочту(Команда)
	ОтправитьПочтуСервер();
КонецПроцедуры

&НаСервере
Процедура ОтправитьПочтуСервер()
  ПутьКФайлу = "D:\Почта";
	ИмяФайла = "ОтчетПоМагазинам";
	ПолноеИмяФайла = ПутьКФайлу + ИмяФайла;
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.ВыгрузитьТДвФайл(ТабДок,ПолноеИмяФайла, "вввв"); 

КонецПроцедуры // ОтправитьПочтуСервер()
